app/Controllers/Produtos.php

INSERT INTO `produto` (`nomeproduto`, `valor`, `categoria_id`) VALUES ('Red Label', '80', '5')
SELECT *
FROM `categoria`
---
    public function inserir()
    {

        $data['titulo'] = 'Inserir novo produto';
        $data['acao'] = 'Inserir';
        $data['msg'] = '';
        $data['erros'] = '';

        if ($this->request->getMethod() === 'post') {
            $produtoModel = new \App\Models\ProdutoModel();
            $dadosProduto = $this->request->getPost();

            if ($produtoModel->insert($dadosProduto)) {
                $data['msg'] = 'Produto inserido com sucesso';
            } else {
                $data['msg'] = 'Erro ao inserir produto';
                $data['erros'] = $produtoModel->errors();
            }


        }

        $categoriaModel = new \App\Models\CategoriaModel();
        $listaCategorias = $categoriaModel->findAll();